using System;
using System.Diagnostics;
using Microsoft.VisualStudio.TestTools.UnitTesting;

namespace UnitTestProject1
{
    [TestClass]
    public class UnitTest1
    {
        /// <summary>
        ///Gets or sets the test context which provides
        ///information about and functionality for the current test run.
        ///</summary>
        private string[] getTaxOffices()
        {
            return new string[]
            {
"ΧΑΛΚΙΔΑΣ ΔΗΜΑΡΧΟΥ ΣΚΟΥΡΑ-ΔΥΟ ΔΕΝΔΡΑ ΔΟΚΟΣ 0 34100 ΕΥΒΟΙΑΣ",
"ΛΑΜΙΑΣ ΑΝΘΗΛΗΣ & ΚΑΝΑΡΗ 0 35100 ΦΘΙΩΤΙΔΟΣ",
"ΑΜΦΙΣΣΑΣ ΑΘΑΝΑΣΙΟΥ ΔΙΑΚΟΥ ΚΑΙ ΑΝΔΡΟΥΤΣΟΥ 0 33100 ΦΩΚΙΔΑΣ",
"ΑΡΓΟΥΣ ΓΟΥΝΑΡΗ 172 21200 ΑΡΓΟΛΙΔΑΣ",
"ΝΑΥΠΛΙΟΥ ΗΡΑΚΛΕΟΥΣ 4 21100 ΑΡΓΟΛΙΔΑΣ",
"ΤΡΙΠΟΛΗΣ ΛΑΓΟΠΑΤΗ 8 22100 ΑΡΚΑΔΙΑΣ",
"ΑΙΓΙΟΥ ΚΑΝΕΛΛΟΠΟΥΛΩΝ 36 25100 ΑΧΑΙΑΣ",
"Α΄ ΠΑΤΡΩΝ ΚΑΝΑΚΑΡΗ 84-86 26110 ΑΧΑΙΑΣ",
"Γ΄ ΠΑΤΡΩΝ ΑΚΤΗ ΔΥΜΑΙΩΝ 18 26331 ΑΧΑΙΑΣ",
"ΑΜΑΛΙΑΔΑΣ ΔΕΛΗΓΙΑΝΝΗ 23 27200 ΗΛΕΙΑΣ",
"ΠΥΡΓΟΥ ΚΑΤΑΚΟΛΟΥ ΚΑΙ ΠΡΟΥΣΣΗΣ 0 27100 ΗΛΕΙΑΣ",
"ΚΟΡΙΝΘΟΥ ΠΑΤΡΩΝ 83 20100 ΚΟΡΙΝΘΙΑΣ",
"ΣΠΑΡΤΗΣ ΜΕΝΕΛΑΟΥ 74 23100 ΛΑΚΩΝΙΑΣ",
"ΚΑΛΑΜΑΤΑΣ ΕΥΑΓΓΕΛΙΣΤΡΙΑΣ 4 24101 ΜΕΣΣΗΝΙΑΣ",
"ΚΑΡΔΙΤΣΑΣ Α ΠΑΠΑΝΔΡΕΟΥ 22 43100 ΚΑΡΔΙΤΣΑΣ",
"Α΄ ΛΑΡΙΣΑΣ ΠΑΠΑΝΑΣΤΑΣΙΟΥ 52 41110 ΛΑΡΙΣΗΣ",
"Β΄ΛΑΡΙΣΑΣ ΠΑΤΡΟΚΛΟΥ 14 41110 ΛΑΡΙΣΗΣ",
"ΒΟΛΟΥ ΞΕΝΟΦΩΝΤΟΣ 1 38333 ΜΑΓΝΗΣΙΑΣ",
"Ν.ΙΩΝΙΑΣ ΒΟΛΟΥ ΤΕΡΜΑ ΑΓ.ΝΕΚΤΑΡΙΟΥ 0 38446 ΜΑΓΝΗΣΙΑΣ",
"ΤΡΙΚΑΛΩΝ ΚΟΛΟΚΟΤΡΩΝΗ ΚΑΙ ΠΤΟΛΕΜΑΙΩΝ 2 42100 ΤΡΙΚΑΛΩΝ",
"ΒΕΡΟΙΑΣ ΛΕΩΦ.ΘΕΣΣΑΛΟΝΙΚΗΣ 131 59100 ΗΜΑΘΙΑΣ",
"Α΄ ΘΕΣΣΑΛΟΝΙΚΗΣ ΤΑΝΤΑΛΟΥ 30 54629 ΘΕΣΣΑΛΟΝΙΚΗΣ",
"Δ΄ ΘΕΣΣΑΛΟΝΙΚΗΣ ΒΑΣ.ΗΡΑΚΛΕΙΟΥ 38 54623 ΘΕΣΣΑΛΟΝΙΚΗΣ",
"Ε΄ ΘΕΣΣΑΛΟΝΙΚΗΣ ΚΡΥΣΤΑΛΛΗ 4 54626 ΘΕΣΣΑΛΟΝΙΚΗΣ",
"ΣΤ΄ ΘΕΣΣΑΛΟΝΙΚΗΣ ΤΑΚΑΝΤΖΑ 8-10 54640 ΘΕΣΣΑΛΟΝΙΚΗΣ",
"Ζ΄ ΘΕΣΣΑΛΟΝΙΚΗΣ Ν.ΠΛΑΣΤΗΡΑ 57 54008 ΘΕΣΣΑΛΟΝΙΚΗΣ",
"ΛΑΓΚΑΔΑ ΛΟΥΤΡΩΝ 51 57200 ΘΕΣΣΑΛΟΝΙΚΗΣ",
"ΦΑΕ ΘΕΣΣΑΛΟΝΙΚΗΣ 26ΗΣ ΟΚΤΩΒΡΙΟΥ 35 54012 ΘΕΣΣΑΛΟΝΙΚΗΣ",
"Η΄ ΘΕΣΣΑΛΟΝΙΚΗΣ ΒΑΣ.ΟΛΓΑΣ 188 54008 ΘΕΣΣΑΛΟΝΙΚΗΣ",
"ΚΑΛΑΜΑΡΙΑΣ ΕΘΝΙΚΗΣ ΑΝΤΙΣΤΑΣΕΩΣ 110 55134 ΘΕΣΣΑΛΟΝΙΚΗΣ",
"ΑΜΠΕΛΟΚΗΠΩΝ ΕΙΡΗΝΗΣ 17 54630 ΘΕΣΣΑΛΟΝΙΚΗΣ",
"ΙΩΝΙΑΣ ΘΕΣΣΑΛΟΝΙΚΗΣ ΒΑΣ.ΓΕΩΡΓΙΟΥ ΚΑΙ ΑΘ.ΔΙΑΚΟΥ 0 57008 ΘΕΣΣΑΛΟΝΙΚΗΣ",
"ΚΑΣΤΟΡΙΑΣ ΛΕΩΦ.ΚΥΚΝΩΝ 2 52100 ΚΑΣΤΟΡΙΑΣ",
"ΚΙΛΚΙΣ 21ΗΣ ΙΟΥΝΙΟΥ 50 61100 ΚΙΛΚΙΣ",
"ΓΡΕΒΕΝΩΝ Κ ΤΑΛΙΑΔΟΥΡΗ 72 51100 ΓΡΕΒΕΝΩΝ",
"ΠΤΟΛΕΜΑΙΔΑΣ ΦΙΛΙΠΠΟΥ 4 50200 ΚΟΖΑΝΗΣ",
"ΚΟΖΑΝΗΣ ΓΚΕΡΤΣΟΥ 22 50100 ΚΟΖΑΝΗΣ",
"ΓΙΑΝΝΙΤΣΩΝ Κ.ΣΤΑΜΚΟΥ 20 58100 ΠΕΛΛΑΣ",
"ΕΔΕΣΣΑΣ ΔΙΟΙΚΗΤΗΡΙΟ 0 58200 ΠΕΛΛΑΣ",
"ΚΑΤΕΡΙΝΗΣ ΧΑΝΤΖΟΓΛΟΥ 48 60100 ΠΙΕΡΙΑΣ",
"ΦΛΩΡΙΝΑΣ ΔΙΟΙΚΗΤΗΡΙΟ 0 53100 ΦΛΩΡΙΝΗΣ",
"ΠΟΛΥΓΥΡΟΥ ΧΑΡΙΛΑΟΥ ΤΡΙΚΟΥΠΗ 33 63100 ΧΑΛΚΙΔΙΚΗΣ",
"ΝΕΩΝ ΜΟΥΔΑΝΙΩΝ ΚΟΥΤΣΑΝΤΩΝΗ 12 63200 ΧΑΛΚΙΔΙΚΗΣ",
"ΔΡΑΜΑΣ ΔΙΟΙΚΗΤΗΡΙΟ 0 66100 ΔΡΑΜΑΣ",
"ΑΛΕΞΑΝΔΡΟΥΠΟΛΗΣ ΑΓ ΔΗΜΗΤΡΙΟΥ 2 68100 ΕΒΡΟΥ",
"ΟΡΕΣΤΙΑΔΑΣ ΙΠΠΟΚΡΑΤΟΥΣ 30 68200 ΕΒΡΟΥ",
"ΚΑΒΑΛΑΣ ΕΘΝ.ΑΝΤΙΣΤΑΣΕΩΣ 20 65110 ΚΑΒΑΛΑΣ",
"ΞΑΝΘΗΣ ΜΕΣΟΛΟΓΓΙΟΥ 13 67100 ΞΑΝΘΗΣ",
"ΚΟΜΟΤΗΝΗΣ ΔΙΟΙΚΗΤΗΡΙΟ 0 69100 ΡΟΔΟΠΗΣ",
"ΣΕΡΡΩΝ ΜΕΡΑΡΧΙΑΣ 50 62125 ΣΕΡΡΩΝ",
"ΑΡΤΑΣ ΠΕΡΙΦΕΡΕΙΑΚΗ 56 56 47100 ΑΡΤΑΣ",
"ΗΓΟΥΜΕΝΙΤΣΑΣ ΕΛΕΥΘΕΡΙΑΣ 8 46100 ΘΕΣΠΡΩΤΙΑΣ",
"ΙΩΑΝΝΙΝΩΝ ΔΟΜΠΟΛΗ 36 45332 ΙΩΑΝΝΙΝΩΝ",
"ΠΡΕΒΕΖΑΣ ΠΟΛΥΤΕΧΝΕΙΟΥ 15 48100 ΠΡΕΒΕΖΗΣ",
"ΘΗΡΑΣ ΘΗΡΑ 0 84700 ΚΥΚΛΑΔΩΝ",
"ΝΑΞΟΥ ΧΩΡΑ ΝΑΞΟΥ 0 84300 ΚΥΚΛΑΔΩΝ",
"ΠΑΡΟΥ ΠΑΡΟΙΚΙΑ 0 84400 ΚΥΚΛΑΔΩΝ",
"ΣΥΡΟΥ ΝΙΚΗΦΟΡΟΥ ΜΑΝΔΗΛΑΡΑ 31 84100 ΚΥΚΛΑΔΩΝ",
"ΜΥΚΟΝΟΥ ΔΡΑΦΑΚΙ 0 84600 ΚΥΚΛΑΔΩΝ",
"ΜΥΤΙΛΗΝΗΣ Π.ΚΟΥΝΤΟΥΡΙΩΤΟΥ 87 81100 ΛΕΣΒΟΥ",
"ΣΑΜΟΥ ΣΑΜΟΣ 0 83100 ΣΑΜΟΥ",
"ΧΙΟΥ Μ.ΛΙΒΑΝΟΥ 66 82100 ΧΙΟΥ",
"ΚΩ Λ.ΚΟΥΝΤΟΥΡΙΩΤΟΥ 7 85300 ΔΩΔΕΚΑΝΗΣΟΥ",
"ΡΟΔΟΥ ΓΕΩΡΓΙΟΥ ΜΑΥΡΟΥ 2 85100 ΔΩΔΕΚΑΝΗΣΟΥ",
"ΗΡΑΚΛΕΙΟΥ Λ.ΚΝΩΣΣΟΥ & ΝΑΘΕΝΑ 0 71409 ΗΡΑΚΛΕΙΟΥ",
"ΑΓΙΟΥ ΝΙΚΟΛΑΟΥ ΕΠΙΜΕΝΙΔΟΥ 20 72100 ΛΑΣΙΘΙΟΥ",
"ΡΕΘΥΜΝΟΥ ΣΤΑΜΑΘΙΟΥΔΑΚΗ 8 74100 ΡΕΘΥΜΝΟΥ",
"ΧΑΝΙΩΝ ΤΖΑΝΑΚΑΚΗ 3 73134 ΧΑΝΙΩΝ",
"ΖΑΚΥΝΘΟΥ ΔΙΟΙΚΗΤΗΡΙΟ 0 29100 ΖΑΚΥΝΘΟΥ",
"ΚΕΡΚΥΡΑΣ ΣΑΜΑΡΑ 13 49100 ΚΕΡΚΥΡΑΣ",
"ΑΡΓΟΣΤΟΛΙΟΥ ΔΙΟΙΚΗΤΗΡΙΟ 0 28100 ΚΕΦΑΛΛΗΝΙΑΣ",
"ΛΕΥΚΑΔΑΣ 8ΗΣ ΜΕΡΑΡΧΙΑΣ 0 31100 ΛΕΥΚΑΔΑΣ"
            };
        }

        [TestMethod]
        public void TaxOfficesTest()
        {
            var taxOffices = this.getTaxOffices();
            var taxOfficesFinal = new string[taxOffices.Length];
            for (int i = 0; i < taxOffices.Length; i++)
            {
                var currentTaxOffice = taxOffices[i];
                if (!string.IsNullOrWhiteSpace(currentTaxOffice))
                {
                    string[] splittedText = currentTaxOffice.Split(' ');

                    if (splittedText?.Length > 1)
                    {
                        string current = splittedText[0];
                        if (current.EndsWith("΄"))
                        {
                            current = current + " " + splittedText[1];
                        }
                        taxOfficesFinal[i] = current;
                        
                    }
                    else Debug.Assert(false);
                }
            }
            Array.Sort(taxOfficesFinal);
            foreach (var finalTaxOffice in taxOfficesFinal)
            {
                Debug.WriteLine(finalTaxOffice);
            }
            //
            // TODO: Add test logic here
            //
        }
    }
}
